---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.PointLocationOnCurve
source: html/79dde20f-6968-4577-53fa-c86e5ce24a77.htm
---
# PointLocationOnCurve Members

Constructs a new instance of a class, with given or default values, to place a point on a curve.